app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "genre", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Ang Probinsyano"], ["description", "probinsyano"], ["genre", "action"], ["duration", "1hr"], ["created_at", "2018-06-14 02:36:04.182353"], ["updated_at", "2018-06-14 02:36:04.182353"]]